app/views/users/show.html.erb

<label>Check out this User's Projects</label>
<%@user.projects.each do |project|%>
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 140]]