app/views/projects/show.html.erb

<label>Posts</label>
<%@project.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."project_id" = ?  [["project_id", 126]]