app/views/posts/show.html.erb

        </svg>
        <small class="text-muted"><%= pluralize(@comments.count, 'Comment') %></small><br><br>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 198]]