app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 104], ["LIMIT", 1]]
---
<p><%=comment.content%></p>
<%=link_to(User.find(comment.user_id).name, user_path(User.find(comment.user_id)))%>