app/controllers/comments_controller.rb

    def create

        @comment = Comment.create({
            content: params[:content],
            post_id: params[:post_id],
            user_id: session[:user_id]
        })
---
INSERT INTO "comments" ("content", "user_id", "post_id") VALUES (?, ?, ?)  [["content", "Woohoo!"], ["user_id", 114], ["post_id", 201]]