app/controllers/posts_controller.rb

    def index
        @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def new
        @post = Post.new()
        @projects = Project.all
        @categories = Category.all
---
SELECT "projects".* FROM "projects"
SELECT "categories".* FROM "categories"

    def show
        @post = Post.find(params[:id])
        @comments = Comment.where(post_id: @post.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 200], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 198]]

    def create
        Post.create(
            title: params[:post][:title],
            description: params[:post][:description],
            image_url: params[:post][:image_url],
            user_id: User.first.id,
            project_id: params[:post][:project_id],
            category_id: params[:post][:category_id]
        )
        redirect_to post_path(Post.last.id)
---
INSERT INTO "posts" ("title", "description", "user_id", "project_id", "category_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def edit
        @post = Post.find(params[:id])
        @projects = Project.all
        @categories = Category.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 244], ["LIMIT", 1]]
SELECT "projects".* FROM "projects"
SELECT "categories".* FROM "categories"

    def update
        # set user to current user id
        @post = Post.find(params[:id])
        @post.update(
            title: params[:post][:title],
            description: params[:post][:description],
            image_url: params[:post][:image_url],
            user_id: User.first.id,
            project_id: params[:post][:project_id],
            category_id: params[:post][:category_id]
        )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 265], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 136], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Travel App Splash Page"], ["description", "Splash page for new travel app design."], ["updated_at", "2020-04-13 22:27:09.150035"], ["id", 265]]