app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 126], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 140], ["LIMIT", 1]]
---
    def show
        @project = Project.find(params[:id])
        @user = User.find(@project.user_id)