app/controllers/users_controller.rb

    def create
        if User.exists?(email: params[:user][:email])
            flash.now[:danger] = "Email already exists, please login instead."
            render :login
        else
            user = User.create(
                name: params[:user][:name],
                email: params[:user][:email],
                password: params[:user][:password]
            )
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("name", "email", "password", "confirm_password") VALUES (?, ?, ?, ?)  [["name", "William Brennan"], ["email", "willfbren@gmail.com"], ["password", "password"], ["confirm_password", "password"]]

    def update
        @user = User.find(params[:id])
        @user.update(
            name: params[:user][:name],
            email: params[:user][:email],
            password: params[:user][:password],
            confirm_password: params[:user][:confirm_password]
        )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 146], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password" = ?, "confirm_password" = ? WHERE "users"."id" = ?  [["name", "William Brennan"], ["email", "willfbren@gmail.com"], ["password", "password"], ["confirm_password", "password"], ["id", 136]]